const chapter5 = {
  id: 5,
  title: "Концепции ООП",
  subchapters: [
    {
      id: "5.1",
      title: "Что такое ООП и зачем оно нужно?",
      content: `  
ООП) — это подход к программированию, при котором программа строится из объектов, которые взаимодействуют друг с другом

Основные идеи ООП:
 • программа ближе к реальному миру 
 • код становится понятнее и удобнее для поддержки
 • большие проекты легче расширять

В реальной жизни мы думаем объектами: человек, машина, телефон
В ООП — так же

Перед тем как изучать ООП, важно понять, что это не единственный способ писать программы

Основные подходы:
 1. Процедурное программирование
Программа — это набор функций и команд, которые выполняются по порядку
 2. Объектно-ориентированное программирование (ООП)
Программа — это набор объектов, которые взаимодействуют между собой


**Пример процедурного подхода**
\`\`\`name = "Илья"
age = 15

def say_hello(name):
    print("Привет, меня зовут", name)

say_hello(name)
\`\`\`
       `
    },
    {
      id: "5.2",
      title: "Что такое функция в Python?",
      content: `
      `
    }
]
}



export default chapter5;